### INSTALLATION AND IMPORTING

In [ ]:
!pip install pandas=1.0.1

In [2]:
import pandas as pd

### SERIES

In [4]:
series1 = pd.Series(["A","B","C","D"])
series1

0    A
1    B
2    C
3    D
dtype: object

In [5]:
type(series1)

pandas.core.series.Series

In [6]:
list1= ["A","B","C","D"]

In [7]:
series1= pd.Series(list1)
series1

0    A
1    B
2    C
3    D
dtype: object

In [8]:
series1 = pd.Series(["A","B","C","D"] , index=["a","b","c","d"])
series1

a    A
b    B
c    C
d    D
dtype: object

In [11]:
series1["d"]

'D'

In [12]:
dict1 = {"a":"A" , "b":"B", "c":"C" , "d":"D"}
series1=pd.Series(dict1)
series1

a    A
b    B
c    C
d    D
dtype: object

### DATAFRAMES

In [13]:
data = {
    "calories" : [45,50,46,88],
    "duration" : [11,25,55,66]
}

In [17]:
df = pd.DataFrame(data , index=["day1","day2","day3","day4"])
df

      calories  duration
day1        45        11
day2        50        25
day3        46        55
day4        88        66

In [24]:
df.loc["day3"] ##

calories    46
duration    55
Name: day3, dtype: int64

### READ CSV FILES

In [ ]:
### Comma seperated value

In [25]:
df = pd.read_csv("data.csv")

In [26]:
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### SOME BASIC OPERATION

In [31]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [33]:
df.tail()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [35]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
770,771,0,3,"Lievens, Mr. Rene Aime",male,24.0,0,0,345781,9.5000,NaN,S
362,363,0,3,"Barbara, Mrs. (Catherine David)",female,45.0,0,1,2691,14.4542,NaN,C
670,671,1,2,"Brown, Mrs. Thomas William Solomon (Elizabeth ...",female,40.0,1,1,29750,39.0000,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.3500,NaN,S

In [36]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [37]:
df.shape

(891, 12)

In [41]:
df["Gender"].value_counts()

Gender
male      577
female    314
Name: count, dtype: int64

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Gender       891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [43]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [44]:
df["Pclass"].unique()

array([3, 1, 2], dtype=int64)

### JOIN DATAFRAMES

In [46]:
df1 = pd.DataFrame({
    "X" : [1,2,3,4,5],
    "Y" : [6,7,8,9,10]
})
df1

   X   Y
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [47]:
df2 = pd.DataFrame({
    "X" : [11,12,13,14,15],
    "Y" : [16,17,18,19,20]
})
df2

    X   Y
0  11  16
1  12  17
2  13  18
3  14  19
4  15  20

In [49]:
df1,df2

(   X   Y
 0  1   6
 1  2   7
 2  3   8
 3  4   9
 4  5  10,
     X   Y
 0  11  16
 1  12  17
 2  13  18
 3  14  19
 4  15  20)

In [50]:
df3 = pd.concat((df1,df2),ignore_index=True)
df3

    X   Y
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10
5  11  16
6  12  17
7  13  18
8  14  19
9  15  20

### APPLY A FUNCTION TO A DATAFRAME

In [53]:
data = {
    "Product" :["A","B","C"],
    "Quantity" : [10,20,30],
    "Price" : [25,50,15]
}
df=pd.DataFrame(data)
df

  Product  Quantity  Price
0       A        10     25
1       B        20     50
2       C        30     15

In [54]:
def total_price(row):
    return row["Quantity"]*row["Price"]

In [59]:
df["Total Price"] = df.apply(total_price , axis=1)

In [60]:
df

  Product  Quantity  Price  Total Price
0       A        10     25          250
1       B        20     50         1000
2       C        30     15          450

### RENAME COLUMN NAME IN DATAFRAME

In [70]:
df = pd.read_csv("data.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [74]:
df.rename(columns = {"PassengerId" : "ID"} , inplace=True)

In [75]:
df.head(3)

,ID,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

###  CHECK NULL AND DUPLICATED VALUES IN A DATAFRAME

In [ ]:
### NULL VALUES

In [77]:
df.isnull().sum()

ID            0
Survived      0
Pclass        0
Name          0
Gender        0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [ ]:
### Duplicated

In [79]:
df.duplicated().sum()

0

### REMOVE NULL VALUES AND DUPLICATED VALUES

In [ ]:
### NULL VALUES

In [81]:
df.dropna(inplace=True)

In [82]:
df.isnull().sum()

ID          0
Survived    0
Pclass      0
Name        0
Gender      0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Cabin       0
Embarked    0
dtype: int64

In [ ]:
### Duplicates

In [83]:
df.drop_duplicates(inplace=True)

In [84]:
df.duplicated().sum()

0

### LOC VS ILOC

In [85]:
data = {
    "Name" : ["Ram" , "Rahul" ,"Mohan"],
    "Age" : [25,42,35],
    "City" : ["Mumbai" , "Delhi" ,"Kolkata"]
}

In [86]:
df = pd.DataFrame(data,index=["person1","person2","person3"])

In [87]:
df

          Name  Age     City
person1    Ram   25   Mumbai
person2  Rahul   42    Delhi
person3  Mohan   35  Kolkata

In [88]:
### LOC
person2 = df.loc["person2"]
person2

Name    Rahul
Age        42
City    Delhi
Name: person2, dtype: object

In [91]:
### Iloc
person2 = df.iloc[0]
person2

Name       Ram
Age         25
City    Mumbai
Name: person1, dtype: object

### REPLACE VALUES IN DATAFRAME

In [92]:
df = pd.read_csv("data.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
male ----->  MALE
female ------> FEMALE

In [93]:
df["Gender"].replace(["male","female"] , ["MALE" , "FEMALE"] , inplace=True)

In [94]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",MALE,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",FEMALE,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",FEMALE,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### CORRELATION

In [12]:
import pandas as pd
df = pd.read_csv("data.csv")

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df_selected = df[["PassengerId", "Survived", "Pclass", "Age"]]
df_selected.head()

   PassengerId  Survived  Pclass   Age
0            1         0       3  22.0
1            2         1       1  38.0
2            3         1       3  26.0
3            4         1       1  35.0
4            5         0       3  35.0

In [14]:
corr = df_selected.corr()

In [15]:
corr

             PassengerId  Survived    Pclass       Age
PassengerId     1.000000 -0.005007 -0.035144  0.036847
Survived       -0.005007  1.000000 -0.338481 -0.077221
Pclass         -0.035144 -0.338481  1.000000 -0.369226
Age             0.036847 -0.077221 -0.369226  1.000000

### GROUPBY VS PIVOT-TABLE

In [19]:
data = {
    "Store" : ["Store A" , "Store A" , "Store B" , "Store B" , "Store C" ,"Store C"],
    "Product" : ["Product1" , "Product2","Product1" , "Product2","Product1" , "Product2"],
    "Sales" : [100,150,200,250,300,350]
}
df = pd.DataFrame(data)
df.head(6)

     Store   Product  Sales
0  Store A  Product1    100
1  Store A  Product2    150
2  Store B  Product1    200
3  Store B  Product2    250
4  Store C  Product1    300
5  Store C  Product2    350

In [ ]:
### Group BY

In [23]:
grouped = df.groupby("Store").sum()
grouped

                  Product  Sales
Store
Store A  Product1Product2    250
Store B  Product1Product2    450
Store C  Product1Product2    650

In [24]:
grouped = df.groupby(["Store","Product"]).sum()
grouped

                  Sales
Store   Product
Store A Product1    100
        Product2    150
Store B Product1    200
        Product2    250
Store C Product1    300
        Product2    350

In [ ]:
### PivotTable

In [25]:
df

     Store   Product  Sales
0  Store A  Product1    100
1  Store A  Product2    150
2  Store B  Product1    200
3  Store B  Product2    250
4  Store C  Product1    300
5  Store C  Product2    350

In [30]:
pivot = pd.pivot_table(df , values="Sales" , index="Store" , aggfunc="sum" )

In [31]:
pivot

         Sales
Store
Store A    250
Store B    450
Store C    650

### MERGING DATASETS

In [35]:
df1 = pd.DataFrame({
    "ID"  : [1,2,3],
    "Name" : ["Ram" , "Mohan" ,"Sohan"]
})

df2 = pd.DataFrame({
    "ID"  : [1,2,3],
    "Age" : [22,23,24]
})

In [36]:
df1

   ID   Name
0   1    Ram
1   2  Mohan
2   3  Sohan

In [37]:
df2

   ID  Age
0   1   22
1   2   23
2   3   24

In [39]:
merge = pd.merge(df1,df2 , on="ID" , how="inner")
merge

   ID   Name  Age
0   1    Ram   22
1   2  Mohan   23
2   3  Sohan   24

### SAVE DATAFRAMES IN CSV , EXCEL OR NUMPY

In [1]:
import pandas as pd
df = pd.read_csv("data.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df.to_csv("new_data.csv" , index=False)

In [3]:
df.to_excel("new_data.xlsx" , index=False)

In [4]:
arr = df.to_numpy()

In [6]:
arr.shape

(891, 12)

### READING DATAFRAMES OTHER THAN CSV FORMAT

In [ ]:
df = pd.read_excel("data.xlsx")
df.head()

In [8]:
df = pd.read_json("data.json")
df.head()

   ID   Name  Age
0   1  Rohan   24
1   2  Mohan   28
2   3  Sohan   26

### SORTING DATAFRAMES

In [9]:
data = {
    "Name" : ["Ram" , "Mohan" , "Sohan" , "Sohail" , "Raghav"],
    "Math" : [85,90,95,60,45],
    "English" : [45,18,78,98,55],
    "Science" : [88,55,66,77,98]
}

In [10]:
df = pd.DataFrame(data)
df.head()

     Name  Math  English  Science
0     Ram    85       45       88
1   Mohan    90       18       55
2   Sohan    95       78       66
3  Sohail    60       98       77
4  Raghav    45       55       98

In [12]:
sorted_df = df.sort_values(by="Math" , ascending=False)
sorted_df

     Name  Math  English  Science
2   Sohan    95       78       66
1   Mohan    90       18       55
0     Ram    85       45       88
3  Sohail    60       98       77
4  Raghav    45       55       98

In [14]:
sorted_df = df.sort_values(by=["Math" , "Science"] , ascending=[True,False])
sorted_df

     Name  Math  English  Science
4  Raghav    45       55       98
3  Sohail    60       98       77
0     Ram    85       45       88
1   Mohan    90       18       55
2   Sohan    95       78       66

### FILTERING DATAFRAMES

In [ ]:
##1. df.isin

In [15]:
data = {
    "Name" : ["Ram" , "Mohan" , "Sohan" , "Sohail" , "Raghav"],
    "Age" : [25,26,27,28,29],
    "Department" : ["HR" , "Finance" , "HR" , "IT" , "Finance"]
}

In [16]:
df = pd.DataFrame(data)
df.head(5)

     Name  Age Department
0     Ram   25         HR
1   Mohan   26    Finance
2   Sohan   27         HR
3  Sohail   28         IT
4  Raghav   29    Finance

In [19]:
filtered_df = df[df["Department"].isin(["HR","IT"])]

In [20]:
filtered_df

     Name  Age Department
0     Ram   25         HR
2   Sohan   27         HR
3  Sohail   28         IT

In [21]:
#### df.where
data = {
    "A" : [1,2,3,4,5],
    "B" : [10,20,30,40,50],
    "C" : [100,200,300,400,500]
}

In [22]:
df = pd.DataFrame(data)
df.head()

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [24]:
new_df = df.where( df["B"]>=30 , 0 )
new_df

   A   B    C
0  0   0    0
1  0   0    0
2  3  30  300
3  4  40  400
4  5  50  500

### TRANSFORMING DATAFRAMES

In [25]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [33]:
new_df = df.transform({"A" : lambda x : x+1 , "B" : lambda x:x*2 , "C":lambda x:x*x })
new_df

   A    B       C
0  2   20   10000
1  3   40   40000
2  4   60   90000
3  5   80  160000
4  6  100  250000

### FILL NULL VALUES USING PANDAS

In [34]:
import numpy as np

In [35]:
data = {
    "A" : [1,np.nan,3,np.nan,5],
    "B" : [np.nan,20,np.nan,40,np.nan]
}

In [36]:
df = pd.DataFrame(data)
df.head()

     A     B
0  1.0   NaN
1  NaN  20.0
2  3.0   NaN
3  NaN  40.0
4  5.0   NaN

In [37]:
filled_df = df.fillna(0)
filled_df

     A     B
0  1.0   0.0
1  0.0  20.0
2  3.0   0.0
3  0.0  40.0
4  5.0   0.0

In [38]:
df

     A     B
0  1.0   NaN
1  NaN  20.0
2  3.0   NaN
3  NaN  40.0
4  5.0   NaN

In [39]:
filled_df = df.fillna({"A" : 0 , "B":1})
filled_df

     A     B
0  1.0   1.0
1  0.0  20.0
2  3.0   1.0
3  0.0  40.0
4  5.0   1.0

In [41]:
df

     A     B
0  1.0   NaN
1  NaN  20.0
2  3.0   NaN
3  NaN  40.0
4  5.0   NaN

In [40]:
filled_df = df.fillna(df.mean())
filled_df

     A     B
0  1.0  30.0
1  3.0  20.0
2  3.0  30.0
3  3.0  40.0
4  5.0  30.0